abourdim/esp32-rxy/arduino/esp32_rxy/esp32_rxy.ino
/*
 * Micro:bit Remote Builder — ESP32 firmware
 *
 * Speaks the same BLE protocol as a BBC micro:bit running the rxy
 * MakeCode template, so the unmodified web app at
 *   https://abourdim.github.io/bit-rxy/
 * can connect to an ESP32 and drive widgets exactly as it would a micro:bit.
 *
 * Target board: ESP32-C3 Super Mini (any ESP32 family chip with BLE works).
 * Library:      NimBLE-Arduino (Library Manager → search "NimBLE-Arduino").
 *               Tested against NimBLE-Arduino 2.x.
 *
 * HOW TO USE
 * ----------
 *  1. Open the rxy web app, switch to the "Build" tab, design your remote.
 *  2. Click "📄 Code". In the generated MakeCode, find the line
 *        const CFG = "..."
 *     Copy the long base64 string.
 *  3. Paste it into LAYOUT_CFG_BASE64 below, replacing the default.
 *  4. Upload to the ESP32, then in the rxy "Play" tab click "📡 Connect"
 *     and pick "BBC micro:bit ESP32" from the chooser. Every widget type
 *     already has a working demo built into handleWidget() below (they
 *     all drive the on-board LED and print to Serial), so try your
 *     layout first — no C++ required yet.
 *  5. Once you wire up real hardware, replace the matching demo in
 *     handleWidget() with your own logic.
 *
 * PROTOCOL (reverse-audited from rxy script.js)
 * ---------------------------------------------
 *  Service:    6e400001-b5a3-f393-e0a9-e50e24dcca9e
 *  Notify:     6e400002-...   (device → app, the micro:bit "TX" characteristic)
 *  Write:      6e400003-...   (app → device, the micro:bit "RX" characteristic)
 *  Encoding:   ASCII lines, '\n' terminated. CRLF tolerated.
 *  App → ESP:  "SET <id> <val>"   or   "GETCFG"
 *  ESP → App:  "UPD <id> <val>"
 *              "CFGBEGIN" / "CFG <chunk>"... / "CFGEND"
 *
 *  Note: the role of characteristics 0002 / 0003 is the OPPOSITE of the
 *  Nordic UART Service convention used by Adafruit/Bluefruit. We follow the
 *  micro:bit's convention here because the web app expects it.
 *
 * =====================================================================
 *  POST-MORTEM: the GETCFG burst failure (rc=6 / BLE_HS_ENOMEM), and
 *  everything it took to actually find the fix
 * =====================================================================
 *  SYMPTOM
 *  -------
 *  Every "Connect" attempt from the web app hung on "Receiving
 *  layout... (N)" forever. N was suspiciously consistent (often 17 of
 *  the ~60 real CFG chunks) across firmware rebuilds, reboots, and even
 *  totally different layouts — a hard, content-independent ceiling,
 *  not random flakiness. Once return-code logging was added (see
 *  CONFIG_NIMBLE_CPP_LOG_LEVEL just below), the cause behind that
 *  ceiling was visible directly: NimBLE's own notify()/indicate() kept
 *  returning rc=6 (BLE_HS_ENOMEM, "not enough memory") on almost every
 *  packet of the burst.
 *
 *  THINGS THAT LOOKED LIKE THE CAUSE BUT WEREN'T
 *  ----------------------------------------------
 *  Each of these was a real, reasoned hypothesis, tested in isolation,
 *  and ruled out — recorded here so nobody re-chases them later:
 *
 *  1. MTU too small / too large. Tried explicit setMTU(247), then
 *     setMTU(64), then no explicit setMTU() call at all (letting
 *     NimBLE's own built-in default of 255 stand). All three gave the
 *     identical rc=6 cascade starting at the identical point. MTU was
 *     never the variable.
 *
 *  2. notify() vs indicate(). Switched the TX characteristic to
 *     INDICATE, added a real wait-for-ack using the characteristic's
 *     onStatus() callback (which fires from the genuine asynchronous
 *     BLE_GAP_EVENT_NOTIFY_TX completion, not just a synchronous
 *     "was it queued?" guess). Still failed identically — indicate()
 *     even got nacked outright in some tests, likely because Web
 *     Bluetooth's startNotifications() only ever enables the notify
 *     CCCD bit, not indicate, on a dual-property characteristic.
 *
 *  3. Retrying on a failed return code. notify()'s bool return turned
 *     out to be an unreliable signal on this stack in general — it
 *     sometimes reported failure for packets that still made it over
 *     the air. Retrying on it was actively harmful: each "failed"
 *     attempt got physically resent anyway, duplicating chunks (the
 *     app's received count was observed exceeding the real total).
 *
 *  4. Connection interval too slow to drain the send queue. Added an
 *     explicit NimBLEServer::updateConnParams() request for a fast
 *     7.5–15ms interval on connect. No change.
 *
 *  5. The periodic demo-output loop racing the CFG burst. loop()'s
 *     once-a-second UPD sends (led_demo, gauge_demo, etc.) run on a
 *     different task than a BLE write callback; added gSendingCfg to
 *     gate them off for the duration of a transfer. Legitimate
 *     hygiene, kept in the fix — but not what was causing rc=6.
 *
 *  6. Arduino-ESP32 core / BLE controller version. The default-
 *     resolved core (2.0.9, IDF 4.4) has a BLE controller config with
 *     CONFIG_BT_CTRL_BLE_STATIC_ACL_TX_BUF_NB=0, which looked like a
 *     smoking gun. Tested against a newer core (2.0.14, IDF 5.x) — same
 *     rc=6 cascade, and the same config value turned out to be present
 *     on BOTH core versions. Red herring.
 *
 *  THE ISOLATION TEST THAT ACTUALLY FOUND IT
 *  ------------------------------------------
 *  After six independent, well-reasoned fixes all failed identically,
 *  continuing to patch the full ~700-line application stopped being
 *  productive. Instead, a separate minimal PlatformIO project was
 *  built (platformio_ble_probe/ in this repo) that talks to the same
 *  GATT service but with no CFG protocol, no demo loop, no app logic
 *  at all — just "on connect, blast N small notify() calls."
 *
 *  - v1 (arbitrary payload, burst fired from loop() on a 1s timer
 *    after connect): 60/60 succeeded. The chip and library are fine.
 *  - v2 (real CFG payload and CFGBEGIN/CFG/CFGEND framing, burst fired
 *    from inside the RX characteristic's onWrite() callback in
 *    response to a real "GETCFG" write — i.e. structured exactly like
 *    this firmware): failed identically, stalling at 17/60 with rc=6.
 *  - v2 again, with the ONLY change being: onWrite() sets a flag
 *    instead of calling the burst function directly, and loop() reads
 *    that flag and runs the burst itself: 60/60 succeeded.
 *
 *  THE ACTUAL ROOT CAUSE
 *  ----------------------
 *  RxCallbacks::onWrite() runs on NimBLE's own host task. The old code
 *  called sendCfg() — a ~900ms loop of 60 notify() calls with delay(15)
 *  between them — directly from inside that callback, meaning the BLE
 *  host task was still "inside" our own code for the whole burst. That
 *  blocked the host task from returning to its own event loop to
 *  process buffer-completion housekeeping (freeing send buffers as the
 *  controller reports they've actually gone out over the air) for the
 *  entire ~900ms — so the pool never had a chance to drain, and every
 *  notify() past the first handful failed with ENOMEM. This is a
 *  well-known class of bug in event-driven / RTOS systems generally:
 *  never do slow, blocking work synchronously inside a callback that
 *  runs on a thread you also depend on to make forward progress.
 *
 *  THE FIX
 *  -------
 *  handleLine() no longer calls sendCfg() when it sees "GETCFG" — it
 *  only sets gGetCfgRequested = true. loop() (running on the ordinary
 *  Arduino main task, not NimBLE's host task) checks that flag once per
 *  iteration and runs sendCfg() from there instead. The BLE host task
 *  is now completely free during the burst to do its own bookkeeping
 *  concurrently, so the buffer pool never starves. Plain NOTIFY (no
 *  indicate, no retry, no wait-for-ack machinery) is reliable once the
 *  burst runs from the right task — none of the complexity from
 *  hypotheses 2–4 above was ever actually needed.
 * =====================================================================
 */

// NimBLE's own NIMBLE_LOGE("failed to send value, rc=%d %s", ...) inside
// notify() is compiled out at the default log level (0 = NONE), which is
// why every "notify() reported failure" in our own logging never showed
// *why*. Must be defined before NimBLEDevice.h is included (nimconfig.h
// only sets its 0 default if these aren't already defined).
#define CONFIG_NIMBLE_CPP_LOG_LEVEL 1
#define CONFIG_NIMBLE_CPP_ENABLE_RETURN_CODE_TEXT

#include <Arduino.h>
#include <NimBLEDevice.h>
#include <esp_system.h>
#include <esp_chip_info.h>
#include <esp_idf_version.h>

// =====================================================================
//  CONFIGURATION  —  edit this section for your project
// =====================================================================

