abourdim/esp32-rxy/arduino/esp32_rxy/esp32_rxy.ino
// Advertised BLE name. MUST start with "BBC micro:bit" or the rxy app
// will not show this device in the connection chooser. The name is short
// on purpose: BLE advertisement packets are only 31 bytes, and combined
// with the 128-bit UART service UUID the budget is tight. Anything longer
// gets silently dropped by some BLE stacks. The rxy filter is a
// namePrefix match, so this exact string qualifies.
static const char* BLE_DEVICE_NAME = "BBC micro:bit";

// Paste the base64 layout string from the rxy "📄 Code" button here.
// The default below is a minimal layout with a single "Test" button.
static const char* LAYOUT_CFG_BASE64 =
 "eyJ0aXRsZSI6IlN1cGVyIERlbW8gUmVtb3RlIiwid2lkZ2V0cyI6W3siaWQiOiJidG5fanVtcCIsInQiOiJidXR0b24iLCJ4Ijo1MTUsInkiOjE5MCwidyI6MTAwLCJoIjoxMDAsImxhYmVsIjoiSnVtcCEiLCJtb2RlbCI6Im5lbyIsInByb3BzIjp7fX0seyJpZCI6ImJ0bl9maXJlIiwidCI6ImJ1dHRvbiIsIngiOjYzMCwieSI6MTkwLCJ3IjoxMDAsImgiOjEwMCwibGFiZWwiOiJGaXJlISIsIm1vZGVsIjoiZ2xhc3MiLCJwcm9wcyI6e319LHsiaWQiOiJzbGlkZXJfc3BlZWQiLCJ0Ijoic2xpZGVyIiwieCI6MzI1LCJ5IjoxOTAsInciOjgwLCJoIjoxNjAsImxhYmVsIjoiU3BlZWQiLCJtb2RlbCI6InRyYWNrIiwibWluIjowLCJtYXgiOjEwMCwic3RlcCI6MSwicHJvcHMiOnt9fSx7ImlkIjoic2xpZGVyX3Bvd2VyIiwidCI6InNsaWRlciIsIngiOjQyMCwieSI6MTkwLCJ3Ijo4MCwiaCI6MTYwLCJsYWJlbCI6IlBvd2VyIiwibW9kZWwiOiJuZW9uIiwibWluIjowLCJtYXgiOjEwMCwic3RlcCI6MSwicHJvcHMiOnt9fSx7ImlkIjoidG9nZ2xlX3R1cmJvIiwidCI6InRvZ2dsZSIsIngiOjE1MCwieSI6MzY1LCJ3IjoxMDAsImgiOjgwLCJsYWJlbCI6IlR1cmJvIiwibW9kZWwiOiJwaWxsIiwicHJvcHMiOnt9fSx7ImlkIjoidG9nZ2xlX3NoaWVsZCIsInQiOiJ0b2dnbGUiLCJ4IjoyNjUsInkiOjM2NSwidyI6MTAwLCJoIjo4MCwibGFiZWwiOiJTaGllbGQiLCJtb2RlbCI6Imljb24iLCJwcm9wcyI6e319LHsiaWQiOiJsZWRfc3RhdHVzIiwidCI6ImxlZCIsIngiOjQ2NSwieSI6MzY1LCJ3Ijo3MCwiaCI6NzAsImxhYmVsIjoiU3RhdHVzIiwibW9kZWwiOiJkb3QiLCJjb2xvck9uIjoiIzAwZTY3NiIsImNvbG9yT2ZmIjoiIzFiMmEzYSIsInByb3BzIjp7fX0seyJpZCI6ImxlZF9hbGVydCIsInQiOiJsZWQiLCJ4Ijo1NTAsInkiOjM2NSwidyI6NzAsImgiOjcwLCJsYWJlbCI6IkFsZXJ0IiwibW9kZWwiOiJyaW5nIiwiY29sb3JPbiI6IiNmZjUyNTIiLCJjb2xvck9mZiI6IiMxYjJhM2EiLCJwcm9wcyI6e319LHsiaWQiOiJqb3lfbW92ZSIsInQiOiJqb3lzdGljayIsIngiOjc2MCwieSI6MTUsInciOjE0MCwiaCI6MTQwLCJsYWJlbCI6Ik1vdmUiLCJtb2RlbCI6InJpbmciLCJwcm9wcyI6e319LHsiaWQiOiJkcGFkX25hdiIsInQiOiJkcGFkIiwieCI6MTUsInkiOjE5MCwidyI6MTQwLCJoIjoxNDAsImxhYmVsIjoiTmF2aWdhdGUiLCJtb2RlbCI6ImNsYXNzaWMiLCJwcm9wcyI6e319LHsiaWQiOiJsYWJlbF9zY29yZSIsInQiOiJsYWJlbCIsIngiOjc0NSwieSI6MTkwLCJ3IjoxODAsImgiOjUwLCJsYWJlbCI6IlNjb3JlOiAwIiwibW9kZWwiOiJjaGlwIiwicHJvcHMiOnt9fSx7ImlkIjoieHlwYWRfYWltIiwidCI6Inh5cGFkIiwieCI6MTcwLCJ5IjoxOTAsInciOjE0MCwiaCI6MTQwLCJsYWJlbCI6IkFpbSIsIm1vZGVsIjoiZ3JpZCIsInByb3BzIjp7fX0seyJpZCI6ImJhdHRlcnlfbGV2ZWwiLCJ0IjoiYmF0dGVyeSIsIngiOjM4MCwieSI6MzY1LCJ3Ijo3MCwiaCI6MTAwLCJsYWJlbCI6IlBvd2VyIiwibW9kZWwiOiJ2ZXJ0aWNhbCIsInByb3BzIjp7fX0seyJpZCI6InRpbWVyX2dhbWUiLCJ0IjoidGltZXIiLCJ4IjoxNSwieSI6MzY1LCJ3IjoxMjAsImgiOjcwLCJsYWJlbCI6IkdhbWUgVGltZSIsIm1vZGVsIjoiZGlnaXRhbCIsImF1dG9TdGFydCI6ZmFsc2UsInByb3BzIjp7fX0seyJpZCI6ImdhdWdlX3RlbXAiLCJ0IjoiZ2F1Z2UiLCJ4Ijo0NTAsInkiOjE1LCJ3IjoxNDAsImgiOjE2MCwibGFiZWwiOiJUZW1wIiwibWluIjowLCJtYXgiOjUwLCJ1bml0cyI6IsKwQyIsImRlY2ltYWxzIjoxLCJtb2RlbCI6ImNsYXNzaWMiLCJ3YXJuIjpudWxsLCJkYW5nZXIiOm51bGwsInByb3BzIjp7fX0seyJpZCI6ImdhdWdlX2xldmVsIiwidCI6ImdhdWdlIiwieCI6NjA1LCJ5IjoxNSwidyI6MTQwLCJoIjoxNjAsImxhYmVsIjoiTGV2ZWwiLCJtaW4iOjAsIm1heCI6MTAwLCJ1bml0cyI6IiUiLCJkZWNpbWFscyI6MCwibW9kZWwiOiJuZW9uIiwid2FybiI6bnVsbCwiZGFuZ2VyIjpudWxsLCJwcm9wcyI6e319LHsiaWQiOiJncmFwaF9lbnYiLCJ0IjoiZ3JhcGgiLCJ4IjoxNSwieSI6MTUsInciOjQyMCwiaCI6MTUwLCJsYWJlbCI6IkxpdmUgRGF0YSIsInNlcmllcyI6Miwid2luZG93U2VjIjozMCwiYXV0b1NjYWxlIjp0cnVlLCJtb2RlbCI6ImdyaWQiLCJtaW4iOjAsIm1heCI6MTAwLCJzaG93TGVnZW5kIjp0cnVlLCJwcm9wcyI6e319XX0=";

// On the ESP32-C3 Super Mini the on-board blue LED is wired to GPIO 8
// and is ACTIVE LOW (write LOW to turn it on). Adjust for your board.
static const int LED_PIN          = 8;
static const int LED_ON           = LOW;
static const int LED_OFF          = HIGH;

// Debug button — when pressed, dumps the current LAYOUT_CFG_BASE64 to
// Serial in the same "CFGBEGIN / CFG <18-char> / CFGEND" framing that
// is sent over BLE. Useful to confirm visually that the layout you
// pasted is what is actually running, without needing a BLE connect.
//
// Defaults to GPIO 9 because that is the on-board BOOT button on the
// ESP32-C3 Super Mini — no extra wiring needed. CAVEAT: GPIO 9 is also
// the C3's BOOT strapping pin. Holding this button while the board is
// powering on / resetting will boot the chip into ROM download mode
// (firmware will not run). It is safe to press AFTER boot completes.
// If you want a separate dedicated debug button without that gotcha,
// wire one between GPIO 0 and GND and change BUTTON_PIN to 0.
static const int BUTTON_PIN       = 9;
static const int BUTTON_ACTIVE    = LOW;

// =====================================================================
//  BLE UUIDs  —  DO NOT CHANGE (these are the micro:bit's UART service)
// =====================================================================
#define UART_SERVICE_UUID   "6e400001-b5a3-f393-e0a9-e50e24dcca9e"
#define UART_TX_CHAR_UUID   "6e400002-b5a3-f393-e0a9-e50e24dcca9e"  // notify
#define UART_RX_CHAR_UUID   "6e400003-b5a3-f393-e0a9-e50e24dcca9e"  // write

// =====================================================================
//  State
// =====================================================================
static NimBLECharacteristic* gTxChar    = nullptr;
static volatile bool         gConnected = false;
// Guards against loop()'s periodic demo output racing sendCfg()'s burst
// now that both run on the same task (see gGetCfgRequested below) — a
// real micro:bit's MakeCode firmware does the same with "if (cfgSent)".
static volatile bool         gSendingCfg = false;
static String                gRxBuffer;

// Set from onWrite() (NimBLE's own host task), consumed from loop() (the
// main Arduino task). THIS WAS THE ACTUAL BUG behind the whole rc=6
// (BLE_HS_ENOMEM) saga: onWrite() used to call sendCfg() directly and
// synchronously — running the ~900ms/60-notify burst ON NimBLE's host
// task while still inside its own callback. That blocks the host task
// from processing its own buffer-completion housekeeping for the whole
// burst, starving the very pool sendCfg() depends on. It was never the
// MTU, indicate() vs notify(), connection interval, or the demo loop —
// isolated testing (see platformio_ble_probe/) proved a 60-packet
// notify() burst works perfectly (60/60) as long as it runs from
// loop(), and fails identically to the real firmware the moment it
// runs from inside a BLE callback instead.
static volatile bool         gGetCfgRequested = false;

// Forward declarations
static void handleLine(const String& line);
static void handleWidget(const String& id, const String& val);
static void sendLine(const String& line);
static void sendCfg();

/**
 * Send "UPD <id> <val>" to the app. Use this to update output widgets
 * like LEDs, labels, gauges, graphs, and battery indicators.
 */
static inline void sendValue(const String& id, const String& val) {
  sendLine("UPD " + id + " " + val);
}

// =====================================================================
//  BLE callbacks
// =====================================================================
class ServerCallbacks : public NimBLEServerCallbacks {
  void onConnect(NimBLEServer* server, NimBLEConnInfo& info) override {
    gConnected = true;
    gRxBuffer  = "";
    Serial.printf("[BLE] Client connected  peer=%s\n",
                  info.getAddress().toString().c_str());
    // Request a fast connection interval (7.5-15ms, units of 1.25ms) so
    // the controller drains notify()'s buffer pool quickly enough to
    // survive sendCfg()'s ~60-chunk burst. Left at whatever slower
    // default the central negotiated, notify() calls pile up faster
    // than the radio can actually transmit them, exhausting NimBLE's
    // mbuf pool and causing it to refuse (return false on) most sends
    // mid-burst — observed as near-universal "dropped" log lines even
    // though most chunks still trickled through opportunistically.
    server->updateConnParams(info.getConnHandle(), 6, 12, 0, 400);
  }
  void onDisconnect(NimBLEServer* /*server*/, NimBLEConnInfo& /*info*/, int reason) override {
    gConnected = false;
    Serial.printf("[BLE] Client disconnected (reason 0x%02x) — re-advertising\n", reason);
    NimBLEDevice::startAdvertising();
  }
  void onMTUChange(uint16_t mtu, NimBLEConnInfo& /*info*/) override {
    Serial.printf("[BLE] MTU negotiated: %u\n", mtu);
  }
};

// Human-readable name for an ESP reset reason code.
static const char* resetReasonStr(esp_reset_reason_t r) {
  switch (r) {
    case ESP_RST_POWERON:   return "POWERON";
    case ESP_RST_EXT:       return "EXT (external pin)";
    case ESP_RST_SW:        return "SW (esp_restart)";
    case ESP_RST_PANIC:     return "PANIC (exception/crash)";
    case ESP_RST_INT_WDT:   return "INT_WDT (interrupt watchdog)";
    case ESP_RST_TASK_WDT:  return "TASK_WDT (task watchdog)";
    case ESP_RST_WDT:       return "WDT (other watchdog)";
    case ESP_RST_DEEPSLEEP: return "DEEPSLEEP wakeup";
    case ESP_RST_BROWNOUT:  return "BROWNOUT";
    case ESP_RST_SDIO:      return "SDIO";
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
    // ESP_RST_USB / ESP_RST_JTAG were added to esp_reset_reason_t in IDF 5.0;
    // older IDF (e.g. arduino-esp32 2.0.9 on IDF 4.4) doesn't declare them.
    case ESP_RST_USB:       return "USB host reset";
    case ESP_RST_JTAG:      return "JTAG";
#endif
    default:                return "UNKNOWN";
  }
}

class RxCallbacks : public NimBLECharacteristicCallbacks {
  void onWrite(NimBLECharacteristic* chr, NimBLEConnInfo& /*info*/) override {
    std::string v = chr->getValue();
    for (size_t i = 0; i < v.size(); ++i) {
      const char c = v[i];
      if (c == '\r') continue;
      if (c == '\n') {
        if (gRxBuffer.length() > 0) {
          handleLine(gRxBuffer);
          gRxBuffer = "";
        }
      } else {
        gRxBuffer += c;
        if (gRxBuffer.length() > 256) gRxBuffer = "";  // overflow guard
      }
    }
  }
};

// =====================================================================
//  Protocol
// =====================================================================
static void sendLine(const String& line) {
  if (!gConnected || gTxChar == nullptr) return;
  String out = line + "\n";
  // Plain NOTIFY, single attempt, no retry, no wait-for-ack. We spent a
  // long time chasing rc=6 (BLE_HS_ENOMEM) through indicate()+confirm
  // handshakes, MTU tuning, and connection-interval tweaks — none of it
  // was the real cause. Isolated testing (platformio_ble_probe/) proved
  // a 60-packet notify() burst succeeds 100% of the time on this exact
  // chip/library, as long as it doesn't run from inside a BLE callback
  // (see gGetCfgRequested and loop() for why that mattered). With the
  // burst correctly deferred to loop(), plain notify() is reliable and
  // needs none of the complexity we tried before.
  gTxChar->notify((const uint8_t*)out.c_str(), out.length());
}

static void sendCfg() {
  gSendingCfg = true;  // block loop()'s demo output for the whole burst
  sendLine("CFGBEGIN");
  const char* p   = LAYOUT_CFG_BASE64;
  const size_t n  = strlen(p);
  const size_t CHUNK = 18;  // matches the official rxy MakeCode template
  for (size_t i = 0; i < n; i += CHUNK) {
    String line = "CFG ";
    for (size_t j = 0; j < CHUNK && (i + j) < n; ++j) line += p[i + j];
    sendLine(line);
    delay(15);  // pace notifications so the BLE stack does not drop any
  }
  sendLine("CFGEND");
  gSendingCfg = false;
  Serial.println("[BLE] Sent CFG");
}

// Dump every piece of state we know about — build info, runtime info,
// BLE state, and the current LAYOUT_CFG_BASE64 (in the same framing
// it is sent over BLE). Called from the button handler. A single
// press gives you a complete snapshot of the firmware at that moment.
static void printAllConfig() {
  // -------- Chip / build --------
  esp_chip_info_t chip;
  esp_chip_info(&chip);

  Serial.println();
  Serial.println("=================== STATE DUMP ===================");
  Serial.printf("[BUILD ] firmware     : Micro:bit Remote — ESP32\n");
  Serial.printf("[BUILD ] compiled     : %s %s\n", __DATE__, __TIME__);
  Serial.printf("[CHIP  ] model        : %d  cores=%u  rev=%u  features=0x%08lx\n",
                (int)chip.model, chip.cores, chip.revision,
                (unsigned long)chip.features);
  Serial.printf("[CHIP  ] sdk_version  : %s\n", esp_get_idf_version());
  Serial.printf("[CHIP  ] arduino_core : %d.%d.%d\n",
                ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR,
                ESP_ARDUINO_VERSION_PATCH);
  Serial.printf("[CHIP  ] cpu_mhz      : %lu\n",
                (unsigned long)getCpuFrequencyMhz());
  Serial.printf("[FLASH ] size         : %lu bytes\n",
                (unsigned long)ESP.getFlashChipSize());
  Serial.printf("[FLASH ] sketch       : %lu / %lu bytes (free %lu)\n",
                (unsigned long)ESP.getSketchSize(),
                (unsigned long)(ESP.getSketchSize() + ESP.getFreeSketchSpace()),
                (unsigned long)ESP.getFreeSketchSpace());

