abourdim/esp32-rxy/arduino/esp32_rxy/esp32_rxy.ino
  // -------- Runtime --------
  esp_reset_reason_t rr = esp_reset_reason();
  Serial.printf("[RUN   ] reset_reason : %d (%s)\n", (int)rr, resetReasonStr(rr));
  Serial.printf("[RUN   ] uptime       : %lu s\n",
                (unsigned long)(millis() / 1000));
  Serial.printf("[RUN   ] free_heap    : %lu bytes\n",
                (unsigned long)ESP.getFreeHeap());
  Serial.printf("[RUN   ] min_heap     : %lu bytes\n",
                (unsigned long)ESP.getMinFreeHeap());

  // -------- GPIO --------
  Serial.printf("[GPIO  ] LED_PIN      : %d  state=%s  (active=%s)\n",
                LED_PIN,
                digitalRead(LED_PIN) == LED_ON ? "ON" : "OFF",
                LED_ON == LOW ? "LOW" : "HIGH");
  Serial.printf("[GPIO  ] BUTTON_PIN   : %d  state=%s  (active=%s)\n",
                BUTTON_PIN,
                digitalRead(BUTTON_PIN) == BUTTON_ACTIVE ? "PRESSED" : "released",
                BUTTON_ACTIVE == LOW ? "LOW" : "HIGH");

  // -------- BLE --------
  NimBLEAdvertising* adv = NimBLEDevice::getAdvertising();
  Serial.printf("[BLE   ] device_name  : '%s'\n", BLE_DEVICE_NAME);
  Serial.printf("[BLE   ] local_mac    : %s\n",
                NimBLEDevice::getAddress().toString().c_str());
  Serial.printf("[BLE   ] service_uuid : %s\n", UART_SERVICE_UUID);
  Serial.printf("[BLE   ] tx_char_uuid : %s (notify)\n", UART_TX_CHAR_UUID);
  Serial.printf("[BLE   ] rx_char_uuid : %s (write)\n",  UART_RX_CHAR_UUID);
  Serial.printf("[BLE   ] advertising  : %s\n",
                (adv && adv->isAdvertising()) ? "YES" : "no");
  Serial.printf("[BLE   ] security     : open (no pairing required)\n");
  Serial.printf("[BLE   ] connected    : %s\n", gConnected ? "YES" : "no");
  Serial.printf("[BLE   ] rx_buf_len   : %u bytes\n",
                (unsigned)gRxBuffer.length());

  // -------- Layout CFG (same framing as BLE GETCFG reply) --------
  const size_t n = strlen(LAYOUT_CFG_BASE64);
  const size_t CHUNK = 18;
  Serial.printf("[CFG   ] total_bytes  : %lu\n", (unsigned long)n);
  Serial.printf("[CFG   ] chunk_size   : %lu\n", (unsigned long)CHUNK);
  Serial.printf("[CFG   ] chunks       : %lu\n",
                (unsigned long)((n + CHUNK - 1) / CHUNK));
  Serial.println("CFGBEGIN");
  for (size_t i = 0; i < n; i += CHUNK) {
    Serial.print("CFG ");
    for (size_t j = 0; j < CHUNK && (i + j) < n; ++j) {
      Serial.print(LAYOUT_CFG_BASE64[i + j]);
    }
    Serial.println();
  }
  Serial.println("CFGEND");

  Serial.println("==================================================");
  Serial.flush();
}

static void handleLine(const String& line) {
  Serial.print("[RX] ");
  Serial.println(line);

  // Defer to loop() — do NOT call sendCfg() directly here. handleLine()
  // runs from onWrite() on NimBLE's own host task; see gGetCfgRequested
  // for why running the burst synchronously from that task was the
  // actual bug all along.
  if (line == "GETCFG") { gGetCfgRequested = true; return; }

  if (line.startsWith("SET ")) {
    int sp = line.indexOf(' ', 4);
    if (sp < 0) return;
    String id  = line.substring(4, sp);
    String val = line.substring(sp + 1);
    handleWidget(id, val);
  }
}

// =====================================================================
//  WIDGET HANDLERS  —  edit this for your project
// =====================================================================
//
// Widget value formats (from the rxy README + audit):
//
//   Button    "btn_..."     val: "0" | "1"
//   Slider    "slider_..."  val: integer in the widget's min..max range
//   Toggle    "toggle_..."  val: "0" | "1"
//   Joystick  "joy_..."     val: "<angle 0-360> <distance 0-100>"
//                                  (angle: 0°=right, 90°=down, 180°=left, 270°=up)
//   D-Pad     "dpad_..."    val: "<up|down|left|right> <0|1>"
//   XY Pad    "xypad_..."   val: "<x 0-100> <y 0-100>"
//   Timer     "timer_..."   val: seconds elapsed (sent ~every 5 s)
//
// To update an output widget (LED, label, gauge, graph, battery)
// call sendValue() from anywhere:
//
//   sendValue("led_status",  "1");
//   sendValue("gauge_temp",  "23");
//   sendValue("label_score", "Score: 42");
//   sendValue("graph_data",  "12,7,18");
//   sendValue("battery_lvl", "75");
//
// A live, running example of all five is in loop() below (search for
// "Output widget demo") — add an LED/Label/Gauge/Graph/Battery widget
// with a matching *_demo ID in the Build tab to see it update once
// connected.
//
// EVERY input widget type below already does something with the one actuator
// this board has out of the box (the on-board LED) and prints what it
// received to Serial. Add ANY widget of that type in the rxy Build tab
// (any id, any name) and it works immediately — no firmware edit needed.
// Once you wire up real hardware (motors, sensors, extra LEDs...),
// replace the body of the matching "if" with your own logic; the
// id/val parsing above each one can stay exactly as-is.

// Sets LED_PIN's brightness from a 0..100 percentage, accounting for the
// C3 Super Mini's on-board LED being active-LOW (0 = full brightness).
static inline void setLedPercent(int pct) {
  pct = constrain(pct, 0, 100);
  int duty = map(pct, 0, 100, 0, 255);
  analogWrite(LED_PIN, LED_ON == LOW ? 255 - duty : duty);
}

static void handleWidget(const String& id, const String& val) {

  // ------- Built-in demo: the shipped default layout's "Test" button ---
  if (id == "btn_test") {
    digitalWrite(LED_PIN, val == "1" ? LED_ON : LED_OFF);
    return;
  }

  // ------- Buttons: LED on while held, off on release -------------------
  if (id.startsWith("btn_")) {
    digitalWrite(LED_PIN, val == "1" ? LED_ON : LED_OFF);
    Serial.printf("[WIDGET] button   '%s' %s\n", id.c_str(), val == "1" ? "pressed" : "released");
    return;
  }

  // ------- Sliders: LED brightness follows the slider --------------------
  if (id.startsWith("slider_")) {
    int pct = val.toInt();               // 0..100 by default
    setLedPercent(pct);
    Serial.printf("[WIDGET] slider   '%s' = %d\n", id.c_str(), pct);
    return;
  }

  // ------- Toggles: LED on/off, stays put until toggled again -----------
  if (id.startsWith("toggle_")) {
    digitalWrite(LED_PIN, val == "1" ? LED_ON : LED_OFF);
    Serial.printf("[WIDGET] toggle   '%s' = %s\n", id.c_str(), val == "1" ? "ON" : "OFF");
    return;
  }

  // ------- Joystick: "<angle> <distance>" — LED brightens as you push ---
  if (id.startsWith("joy_")) {
    int sp    = val.indexOf(' ');
    int angle = val.substring(0, sp).toInt();
    int dist  = val.substring(sp + 1).toInt();   // 0..100, how far from center
    setLedPercent(dist);
    Serial.printf("[WIDGET] joystick '%s' angle=%d dist=%d\n", id.c_str(), angle, dist);
    return;
  }

  // ------- D-Pad: "<direction> <0|1>" — LED on while any key is held -----
  if (id.startsWith("dpad_")) {
    int sp     = val.indexOf(' ');
    String dir = val.substring(0, sp);          // "up" | "down" | "left" | "right"
    bool  down = val.substring(sp + 1) == "1";
    digitalWrite(LED_PIN, down ? LED_ON : LED_OFF);
    Serial.printf("[WIDGET] dpad     '%s' %s %s\n", id.c_str(), dir.c_str(), down ? "pressed" : "released");
    return;
  }

  // ------- XY Pad: "<x> <y>" (0..100 each) — LED brightness follows y ----
  if (id.startsWith("xypad_")) {
    int sp = val.indexOf(' ');
    int x  = val.substring(0, sp).toInt();
    int y  = val.substring(sp + 1).toInt();
    setLedPercent(y);
    Serial.printf("[WIDGET] xypad    '%s' x=%d y=%d\n", id.c_str(), x, y);
    return;
  }

  // ------- Timer: seconds elapsed — LED blinks once per tick -------------
  if (id.startsWith("timer_")) {
    digitalWrite(LED_PIN, digitalRead(LED_PIN) == LED_ON ? LED_OFF : LED_ON);
    Serial.printf("[WIDGET] timer    '%s' = %ds\n", id.c_str(), val.toInt());
    return;
  }
}

// =====================================================================
//  Setup / Loop
// =====================================================================
void setup() {
  Serial.begin(115200);
  delay(200);                                 // give USB-CDC time to enumerate
  Serial.println();
  Serial.println("=================================================");
  Serial.println("=== Micro:bit Remote — ESP32 firmware (boot) ===");
  Serial.println("=================================================");

  // ----- Boot diagnostics -----------------------------------------------
  esp_reset_reason_t rr = esp_reset_reason();
  Serial.printf("[BOOT] reset_reason : %d (%s)\n", (int)rr, resetReasonStr(rr));

  esp_chip_info_t chip;
  esp_chip_info(&chip);
  Serial.printf("[BOOT] chip_model   : %d  cores=%u  rev=%u  features=0x%08lx\n",
                (int)chip.model, chip.cores, chip.revision,
                (unsigned long)chip.features);
  Serial.printf("[BOOT] sdk_version  : %s\n", esp_get_idf_version());
  Serial.printf("[BOOT] arduino_core : %d.%d.%d\n",
                ESP_ARDUINO_VERSION_MAJOR, ESP_ARDUINO_VERSION_MINOR,
                ESP_ARDUINO_VERSION_PATCH);
  Serial.printf("[BOOT] cpu_mhz      : %lu\n",
                (unsigned long)getCpuFrequencyMhz());
  Serial.printf("[BOOT] free_heap    : %lu bytes\n",
                (unsigned long)ESP.getFreeHeap());
  Serial.printf("[BOOT] min_heap     : %lu bytes\n",
                (unsigned long)ESP.getMinFreeHeap());
  Serial.printf("[BOOT] flash_size   : %lu bytes\n",
                (unsigned long)ESP.getFlashChipSize());
  Serial.printf("[BOOT] sketch_size  : %lu / %lu bytes\n",
                (unsigned long)ESP.getSketchSize(),
                (unsigned long)ESP.getFreeSketchSpace());
  Serial.flush();

  // ----- Step 1: GPIO ---------------------------------------------------
  Serial.println("[SETUP] step 1/4 — GPIO init");
  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, LED_OFF);
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  Serial.printf("[GPIO] LED_PIN=%d  BUTTON_PIN=%d (INPUT_PULLUP, press to dump CFG)\n",
                LED_PIN, BUTTON_PIN);

  // ----- Step 2: NimBLE init -------------------------------------------
  Serial.println("[SETUP] step 2/4 — NimBLEDevice::init");
  NimBLEDevice::init(BLE_DEVICE_NAME);
  NimBLEDevice::setPower(ESP_PWR_LVL_P9);
  // No explicit setMTU() call — matches a real micro:bit, which never
  // calls anything like setMTU() either. NimBLE-Arduino's own built-in
  // default preferred MTU (255, per nimconfig.h) already gives plenty
  // of room for a 23-byte "CFG <18-char>\n" line, so nothing further
  // is needed here.

  // Match a real micro:bit's MakeCode "No pairing required: anyone can
  // connect via Bluetooth" mode. Explicit, not relying on NimBLE/SDK
  // defaults — those can flip across versions and some BLE centrals
  // (notably macOS) treat an UNSPECIFIED security policy more strictly
  // than an explicitly-open one.
  //
  // SECURITY CAVEAT: with these settings, anyone in radio range can
  // write SET commands to this device. Fine for a desk toy / classroom
  // remote (matches what micro:bits do); WRONG for anything sensitive.
  NimBLEDevice::setSecurityAuth(false, false, false);   // no bonding / MITM / LESC
  NimBLEDevice::setSecurityIOCap(BLE_HS_IO_NO_INPUT_OUTPUT);
  NimBLEDevice::deleteAllBonds();                       // discard any prior pairings
  Serial.printf("[BLE] device_name   : '%s'\n", BLE_DEVICE_NAME);
  Serial.printf("[BLE] local_mac     : %s\n",
                NimBLEDevice::getAddress().toString().c_str());
  Serial.printf("[BLE] heap_after_init: %lu bytes\n",
                (unsigned long)ESP.getFreeHeap());

