abourdim/esp32-rxy/arduino/esp32_rxy/esp32_rxy.ino
  // ----- Step 3: GATT service + characteristics ------------------------
  Serial.println("[SETUP] step 3/4 — GATT service setup");
  NimBLEServer* server = NimBLEDevice::createServer();
  server->setCallbacks(new ServerCallbacks());

  NimBLEService* svc = server->createService(UART_SERVICE_UUID);

  gTxChar = svc->createCharacteristic(
              UART_TX_CHAR_UUID,
              NIMBLE_PROPERTY::NOTIFY);

  NimBLECharacteristic* rxChar = svc->createCharacteristic(
              UART_RX_CHAR_UUID,
              NIMBLE_PROPERTY::WRITE | NIMBLE_PROPERTY::WRITE_NR);
  rxChar->setCallbacks(new RxCallbacks());

  svc->start();
  Serial.printf("[BLE] service_uuid  : %s\n", UART_SERVICE_UUID);
  Serial.printf("[BLE] tx_char_uuid  : %s (notify)\n", UART_TX_CHAR_UUID);
  Serial.printf("[BLE] rx_char_uuid  : %s (write)\n",  UART_RX_CHAR_UUID);

  // ----- Step 4: Advertising -------------------------------------------
  // Mimic exactly what a real micro:bit running MakeCode does:
  //   - Primary packet contains FLAGS + NAME only (no service UUID).
  //   - The Nordic UART service is exposed via GATT after connect, not
  //     announced in the advertisement. rxy / bit-playground / nRF
  //     Connect all discover it via optionalServices on the JS side.
  //   - Advertising interval pinned to 200 ms (matches MakeCode's
  //     pxt.json: "advertising_interval": 200).
  //
  // Why this matters: with our 13-char name (15 bytes) + a 128-bit
  // service UUID (18 bytes) + flags (3 bytes), the primary advertising
  // packet overflows the 31-byte BLE limit and NimBLE is forced to
  // shove the name into a scan-response packet. macOS Web Bluetooth
  // (Chrome on macOS) handles scan-response-borne names unreliably —
  // the device becomes invisible in the pair chooser even though
  // phones see it fine. Dropping the service UUID frees enough room
  // for the name to live in the primary packet, which every BLE
  // central scans reliably.
  Serial.println("[SETUP] step 4/4 — start advertising");
  NimBLEAdvertising* adv = NimBLEDevice::getAdvertising();
  adv->setName(BLE_DEVICE_NAME);
  adv->enableScanResponse(false);                       // name fits in primary
  adv->setMinInterval(0x140);                           // 320 * 0.625 ms = 200 ms
  adv->setMaxInterval(0x140);
  NimBLEDevice::startAdvertising();

  Serial.printf("[BLE] advertising as: '%s'\n", BLE_DEVICE_NAME);
  Serial.printf("[BOOT] setup() OK   — free_heap=%lu bytes\n",
                (unsigned long)ESP.getFreeHeap());
  Serial.println("[BLE] Open https://abourdim.github.io/bit-rxy/ and click Connect.");
  Serial.println("=================================================");
  Serial.flush();
}

void loop() {
  const uint32_t now = millis();

  // -----------------------------------------------------------------
  // Handle a pending GETCFG here, not from onWrite() — see
  // gGetCfgRequested for why running the burst directly from the BLE
  // callback was the actual cause of the CFG-transfer failures.
  // -----------------------------------------------------------------
  if (gGetCfgRequested) {
    gGetCfgRequested = false;
    sendCfg();
  }

  // -----------------------------------------------------------------
  // Periodic heartbeat — confirms the firmware is alive and shows
  // connection state + heap headroom. Cheap, prints once every 5 s.
  // -----------------------------------------------------------------
  static uint32_t lastBeat = 0;
  if (now - lastBeat >= 5000) {
    lastBeat = now;
    Serial.printf("[HB] uptime=%lus  connected=%d  heap=%lu  min_heap=%lu\n",
                  (unsigned long)(now / 1000),
                  gConnected ? 1 : 0,
                  (unsigned long)ESP.getFreeHeap(),
                  (unsigned long)ESP.getMinFreeHeap());
  }

  // -----------------------------------------------------------------
  // BUTTON_PIN poll — on a clean press (active-low, debounced 30 ms),
  // dump the LAYOUT_CFG_BASE64 to Serial. Edge-triggered: only fires
  // once per press, not while held.
  // -----------------------------------------------------------------
  static int      btnLast       = HIGH;
  static uint32_t btnLastChange = 0;
  const int btnNow = digitalRead(BUTTON_PIN);
  if (btnNow != btnLast && (now - btnLastChange) > 30) {
    btnLastChange = now;
    if (btnNow == BUTTON_ACTIVE) {
      Serial.println("[BTN] press detected — dumping full state");
      printAllConfig();
    }
    btnLast = btnNow;
  }

  // -----------------------------------------------------------------
  // Output widget demo — the other half of the widget catalog. LED,
  // Label, Gauge, Graph, and Battery widgets are OUTPUTS (micro:bit -> app):
  // they never appear in handleWidget() because they don't send SET
  // messages, they only receive sendValue() updates. The firmware can't
  // see what you named them in the Build tab (LAYOUT_CFG_BASE64 is an
  // opaque blob to it), so add a widget of the matching type using one
  // of the IDs below (or edit the strings here to match yours) to see
  // it update live once connected. Runs once a second — the rxy app
  // rate-limits incoming messages to about one per 200 ms, so don't
  // go faster than that.
  // -----------------------------------------------------------------
  static uint32_t lastOutputDemo = 0;
  if (gConnected && !gSendingCfg && now - lastOutputDemo >= 1000) {
    lastOutputDemo = now;
    static int demoTick = 0;
    demoTick++;
    sendValue("led_demo",     (demoTick % 2) ? "1" : "0");             // blinks every tick
    sendValue("label_demo",   "Tick " + String(demoTick));             // free-text label
    sendValue("gauge_demo",   String((int)temperatureRead()));         // chip temp in °C
    sendValue("graph_demo",   String(demoTick % 100) + "," + String((demoTick * 3) % 100));
    sendValue("battery_demo", String(100 - (demoTick % 100)));         // fake drain 100 -> 0
  }
}
